import React, { PureComponent } from 'react'

import {
  withRouter,
  Link
} from 'react-router-dom'
import BScroll from 'better-scroll'
import { Toast } from 'antd-mobile'
import fetch from 'utils/fetch'
import { RegCon, MainCon, InputCon } from './styled'

class Register extends PureComponent {
  constructor(props) {
    super(props) 
    this.state = {
      username: '',
      pwd: '',
      phone: '',
    } 
    this.handleClick = this.handleClick.bind(this)
  }
  render() {
    return (
      <RegCon>
        <MainCon id='reg-scroll'>
        <em>
          <InputCon> 
            <span>
              <svg viewBox="0 0 1024 1024" width="32" height="32"><path d="M858.5 763.6c-18.9-44.8-46.1-85-80.6-119.5-34.5-34.5-74.7-61.6-119.5-80.6-0.4-0.2-0.8-0.3-1.2-0.5C719.5 518 760 444.7 760 362c0-137-111-248-248-248S264 225 264 362c0 82.7 40.5 156 102.8 201.1-0.4 0.2-0.8 0.3-1.2 0.5-44.8 18.9-85 46-119.5 80.6-34.5 34.5-61.6 74.7-80.6 119.5C146.9 807.5 137 854 136 901.8c-0.1 4.5 3.5 8.2 8 8.2h60c4.4 0 7.9-3.5 8-7.8 2-77.2 33-149.5 87.8-204.3 56.7-56.7 132-87.9 212.2-87.9s155.5 31.2 212.2 87.9C779 752.7 810 825 812 902.2c0.1 4.4 3.6 7.8 8 7.8h60c4.5 0 8.1-3.7 8-8.2-1-47.8-10.9-94.3-29.5-138.2zM512 534c-45.9 0-89.1-17.9-121.6-50.4S340 407.9 340 362c0-45.9 17.9-89.1 50.4-121.6S466.1 190 512 190s89.1 17.9 121.6 50.4S684 316.1 684 362c0 45.9-17.9 89.1-50.4 121.6S557.9 534 512 534z" p-id="14066" fill="#2c2c2c"></path></svg>
            </span>
            <b>
              <input type='text' placeholder='请输入用户名' autoComplete="off"
                value={this.state.username}
                onChange={(e) => {this.setState({ username: e.target.value })}} 
                onBlur={() => {this.setState({ isusername: true })}} 
                onFocus={() => {this.setState({ isusername: false })}}
                onInput={(e) => {if(e.target.value.length>11) e.target.value=e.target.value.slice(0,10)}}
              />
            </b>
            {
              this.state.username && !!!this.state.isusername ? 
              (<i>
                  <svg onClick={() => {this.setState({ username: '' })}} 
                    viewBox="0 0 1024 1024" width="25" height="25"><path d="M512 896C299.936 896 128 724.064 128 512S299.936 128 512 128s384 171.936 384 384-171.936 384-384 384m0-832C264.96 64 64 264.96 64 512s200.96 448 448 448 448-200.96 448-448S759.04 64 512 64" fill="#181818" p-id="2171"></path><path d="M665.376 313.376L512 466.752l-153.376-153.376-45.248 45.248L466.752 512l-153.376 153.376 45.248 45.248L512 557.248l153.376 153.376 45.248-45.248L557.248 512l153.376-153.376z" fill="#181818" p-id="2172"></path></svg>
              </i>) 
              : 
              (<></>)
            }
          </InputCon>
          <InputCon> 
            <span>
              <svg viewBox="0 0 1024 1024" width="32" height="32"><path d="M781.472 0H242.528a80.832 80.832 0 0 0-80.832 80.832v862.304a80.832 80.832 0 0 0 80.832 80.832h538.944a80.832 80.832 0 0 0 80.832-80.832V80.832A80.832 80.832 0 0 0 781.472 0z m-124.48 53.888l-19.392 39.072a27.008 27.008 0 0 1-23.968 14.816h-202.912a26.944 26.944 0 0 1-23.904-14.656l-0.064-0.16-19.68-39.072z m151.424 889.28a26.944 26.944 0 0 1-26.944 26.944H242.528a26.944 26.944 0 0 1-26.944-26.944V80.864c0-14.88 12.064-26.944 26.944-26.944h64.128l31.52 63.072a80.992 80.992 0 0 0 72.32 44.736h203.072a80.8 80.8 0 0 0 72-44.288l0.224-0.448 31.52-63.072h64.128c14.88 0 26.944 12.064 26.944 26.944z" fill="#2c2c2c" p-id="5838"></path><path d="M646.752 862.304H377.28a26.944 26.944 0 0 0 0 53.888h269.472a26.944 26.944 0 0 0 0-53.888z" fill="#2c2c2c" p-id="5839"></path></svg>
            </span>
            <b>
              <input type='number' placeholder='请输入手机号' autoComplete="off"
                value={this.state.phone}
                onChange={(e) => {this.setState({ phone: e.target.value })}} 
                onBlur={() => {this.setState({ isphone: true })}} 
                onFocus={() => {this.setState({ isphone: false })}}
                onInput={(e) => {if(e.target.value.length>11) e.target.value=e.target.value.slice(0,11)}}
              />
            </b>
            {
              this.state.phone && !!!this.state.isphone ? 
              (<i>
                  <svg onClick={() => {this.setState({ phone: '' })}} 
                    viewBox="0 0 1024 1024" width="25" height="25"><path d="M512 896C299.936 896 128 724.064 128 512S299.936 128 512 128s384 171.936 384 384-171.936 384-384 384m0-832C264.96 64 64 264.96 64 512s200.96 448 448 448 448-200.96 448-448S759.04 64 512 64" fill="#181818" p-id="2171"></path><path d="M665.376 313.376L512 466.752l-153.376-153.376-45.248 45.248L466.752 512l-153.376 153.376 45.248 45.248L512 557.248l153.376 153.376 45.248-45.248L557.248 512l153.376-153.376z" fill="#181818" p-id="2172"></path></svg>
              </i>) 
              : 
              (<></>)
            }
          </InputCon>
          <InputCon> 
            <span>
              <svg viewBox="0 0 1024 1024" width="32" height="32"><path d="M839.744 317.312C825.28 140.352 684.864 0.96 514.112 0.96S203.008 140.352 188.608 317.248h-6.08c-47.296 0-85.76 40.768-85.76 90.816v507.392c0 50.048 38.464 90.752 85.76 90.752h656.768c47.232 0 85.76-40.704 85.76-90.752V408.064c0-49.92-38.272-90.496-85.312-90.752z m-325.632-250.24c136.256 0 247.552 109.888 261.824 250.24h-523.52c14.336-140.352 125.44-250.24 261.76-250.24z m351.744 848.384c0 15.232-12.16 28.16-26.56 28.16H182.528c-14.464 0-26.624-12.928-26.624-28.16V408.064c0-15.552 11.904-28.16 26.624-28.16h34.432c0.448 0 0.896 0.32 1.344 0.32 0.512 0 0.96-0.32 1.472-0.32h588.8c0.448 0 0.896 0.32 1.344 0.32 0.512 0 0.96-0.32 1.472-0.32h27.904c14.72 0 26.56 12.608 26.56 28.16v507.392z" p-id="2285" fill="#2c2c2c"></path><path d="M513.088 553.6c-32.64 0-59.136 28.096-59.136 62.656a62.08 62.08 0 0 0 39.296 58.432c-0.256 1.408-0.768 2.688-0.768 4.16v62.592c0 12.032 9.152 21.824 20.608 21.824 11.328 0 20.544-9.792 20.544-21.76v-62.72c0-1.408-0.512-2.688-0.768-4.096a62.144 62.144 0 0 0 39.36-58.432c0-34.56-26.56-62.656-59.136-62.656z" p-id="2286" fill="#2c2c2c"></path></svg>
            </span> 
            <b>
              <input type={!!this.state.isshow ? 'text' : 'password'}
                maxLength='16' placeholder='请输入密码(最多16位)' autoComplete="off"
                value={this.state.pwd}
                onChange={(e) => {this.setState({ pwd: e.target.value })}} 
                onBlur={() => {this.setState({ ispwd: true })}} 
                onFocus={() => {this.setState({ ispwd: false })}}
              />
            </b>
            {
              this.state.pwd && !!!this.state.ispwd ? 
              (<i onClick={() => {this.setState({ isshow: !this.state.isshow })}}> 
                {
                  !!this.state.isshow ? 
                  (<svg viewBox="0 0 1027 1024" width="25" height="25"><path d="M512 682.666667c-93.866667 0-170.666667-76.8-170.666667-170.666667s76.8-170.666667 170.666667-170.666667 170.666667 76.8 170.666667 170.666667S605.866667 682.666667 512 682.666667zM512 426.666667c-46.933333 0-85.333333 38.4-85.333333 85.333333s38.4 85.333333 85.333333 85.333333 85.333333-38.4 85.333333-85.333333S558.933333 426.666667 512 426.666667z" p-id="4569"></path><path d="M512 853.333333c-320 0-499.2-307.2-507.733333-320-8.533333-12.8-8.533333-29.866667 0-42.666667C12.8 477.866667 192 170.666667 512 170.666667s499.2 307.2 507.733333 320c8.533333 12.8 8.533333 29.866667 0 42.666667C1011.2 546.133333 832 853.333333 512 853.333333zM93.866667 512c42.666667 64 192 256 418.133333 256 226.133333 0 375.466667-192 418.133333-256-42.666667-64-192-256-418.133333-256C285.866667 256 136.533333 448 93.866667 512z" p-id="4570"></path></svg>                  )
                  :
                  (<svg viewBox="0 0 1024 1024" width="25" height="25"><path d="M941.677 391.71c9.338-14.006 6.225-32.681-6.225-43.575-14.006-10.894-32.681-7.781-43.575 6.225-1.557 1.556-174.3 205.426-379.728 205.426-199.2 0-379.727-205.426-381.283-206.982-10.895-12.45-31.125-14.006-43.576-3.113-12.45 10.894-14.006 31.125-3.113 43.576 3.113 4.668 40.463 46.687 99.6 93.375l-79.37 82.482c-12.45 12.45-10.893 32.681 1.557 43.575 3.113 6.225 10.894 9.338 18.676 9.338 7.78 0 15.562-3.113 21.787-9.338l85.594-88.706c40.463 28.013 88.707 54.47 141.62 73.144l-32.682 110.495c-4.668 17.118 4.67 34.237 21.788 38.906h9.337c14.006 0 26.457-9.338 29.569-23.344l32.681-110.495c24.9 4.669 51.357 7.782 77.813 7.782s52.913-3.113 77.814-7.782l32.68 108.939c3.114 14.006 17.12 23.343 29.57 23.343 3.113 0 6.225 0 7.782-1.556 17.118-4.67 26.456-21.787 21.788-38.906L649.099 595.58c52.914-18.676 101.157-45.132 141.62-73.144l84.038 87.15c6.225 6.225 14.006 9.338 21.787 9.338 7.781 0 15.563-3.113 21.787-9.337 12.45-12.451 12.45-31.125 1.557-43.576l-79.37-82.481c63.808-46.689 101.16-91.82 101.16-91.82z" p-id="5048"></path></svg>)
                }
              </i>) 
              : 
              (<></>)
            }
          </InputCon>
          
          <>
            <span
              className={( this.state.pwd && this.state.phone && this.state.username) ? 'active' : '' }
              onClick={this.handleClick}
            >注 册</span>
            <span className='cancel' onClick={() => {this.props.history.push('/home')}}>取 消</span>
            <i>
              <Link to='/user/login'>已有账号？去登录吧</Link>
            </i>
          </>
        </em>
        </MainCon>
      </RegCon>
    )
  }

  componentDidMount() {
    new BScroll('#reg-scroll', {
      click: true
    })
  }

  async handleClick() {
    if(!(this.state.pwd && this.state.phone && this.state.username)) return 
    let url = '/ws/api/v1/users/register'
    let postData = {
      username: this.state.username,
      phone: this.state.phone,
      pwd: this.state.pwd
    }
    let result = await fetch.post({url,postData})
    if(result.code === 200) {
      Toast.success('注册成功,去登录吧',1)
      this.props.history.push('/user/login')
    } else {
      Toast.fail(result.msg,1)
    }
  }
}

export default withRouter(Register)